import time

MONEY_AMOUNT_TO_BE_VERY_RICH = 100
MONEY_AMOUNT_TO_BE_NOT_POOR = 10
BEERS_TO_BECOME_DRUNK = 12
DISTANCE_FROM_BAR_TO_HOME = 5
MONEY_TO_LIVE = 40
PROPERTY = {
    'диван': 10,
    'шкаф': 10,
    'машина': 70,
    'компьютер': 20,
    'коллекция фантиков': 50,
    'телефон': 10,
    'сервиз': 10,
    'зонт': 5
}
SATISFACTION_OF_SALES = {
    'диван': -0.5,
    'шкаф': 1,
    'машина': 0,
    'компьютер': -0.5,
    'коллекция фантиков': -1,
    'телефон': 0,
    'сервиз': 2,
    'зонт': 0
}
PROFITS = {
    'диван': 10,
    'шкаф': 10,
    'машина': 70,
    'компьютер': 20,
    'коллекция фантиков': 0,
    'телефон': 10,
    'сервиз': 40,
    'зонт': 0
}
painted_bears_house = False


def step3_no_money():
    print('Придя домой, утка обнаружила, что это были все ещё сбережения.')
    print('Утка вспомнила, что через 2 дня ей настанет пора платить по кредиту. Зарплата только 2 недели.')
    print('Что посоветуете утке сделать? 1. Взять в долг у соседа. 2. Продать часть имущества. Введите число.')
    option = ''
    option = input()
    if option == '1':
        print('Утка в хороших отношениях с соседом, поэтому без проблем смогла взять денег в долг до получки.')
        print('Через две недели, когда пришла зарплата, утка вернула долг, и решила отпраздновать получку походом в бар.')
        step1()
        return
    print(f'Чтобы прожить 2 недели и заплатить по кредиту, утке нужно {MONEY_TO_LIVE} монет. Ниже представлено имущество утки и цена, за которую она готова продать.')
    for name, price in PROPERTY.items():
        print(f'{name} за {price} монет')
    print('Введите через запятую название того, что утке стоит выставить на Авито.')
    items = input().replace(' ,', '').lower().split(',')
    to_sale = {item: PROPERTY[item] for item in items if item in PROPERTY}
    print('Утка выставила на Авито следующие товары: ', list(to_sale.keys()))

    profit = 0
    satisfaction = 0
    car_is_sold = False
    for item in to_sale:
        if item == 'диван':
            print('Диван купили почти сразу. Утке он очень нравился, но к сожалению ей надо что-то кушать. Спать она будет теперь на раскладушке')
        elif item == 'шкаф':
            print('Утка давно хотела избавиться от шкафа, но ей было лениво его выкинуть. А тут и шкаф грузчики сами вынесут, и денег она получит.')
        elif item == 'машина':
            print('Машина у утки не самая лучшая, но покупатель нашёлся почти сразу - он очень любит пересобирать старые машины.')
            car_is_sold = True
        elif item == 'компьютер':
            print('Утка очень любит играть по вечерам в доту, но ей очень нужны деньги. "Ну может начну вечерами книжки читать," - подумала утка.')
        elif item == 'коллекция фантиков':
            print('К сожалению, коллекция фантиков, которую утка так упорно собирала уже на протяжении 30 утиных лет, никого не заинтересовала, поэтому утка не смогла её продать.')
        elif item == 'телефон':
            print('Утке пришлось достать из загашника старую кнопочную нокию. Теперь, вместо листания мемов, в туалете утка будет играть в змейку.')
        elif item == 'сервиз':
            print('Пришёл коллекционер, который был крайне удивлён такой низкой цене за коллекционный сервиз из Гуся-Хрустального, по всей стране таких сервизов насчитывается всего 100 штук.')
            print('Коллекционер по доброте душевной добавил ещё 30 монет.')
        elif item == 'зонт':
            print('Вспомнив, что именно из-за того, что утка не взяла с собой зонт, она почти сразу же удалила объявление после публикации.')
        else:
            print(f'Утка продала {item}')
        satisfaction += SATISFACTION_OF_SALES[item]
        profit += PROFITS[item]
        time.sleep(1)
    print(f'Утке удалось продать товаров на {profit} монет.')
    time.sleep(1)

    if (profit < MONEY_TO_LIVE):
        print('Утка не смогла расплатиться с долгами. Её посадили в тюрьму.')
        return
    print('Утка смогла расплатиться с долгами.')
    if car_is_sold:
        print('Утка использовала машину, чтобы ездить по объектам со своими красками и инструментами. К сожалению, утка больше не может работать маляром.')
        print('Через неделю утка устроилась кассиром в "Невкусно и что?", работа ей не нравится, но на жизнь хватает.')
        return
    if satisfaction < 0:
        print('Утке очень не понравилось продавать свои вещи на Авито, и она пообещала себе больше никогда не пить.')
        step1()
    else:
        print('Утке так понравилось продавать товары на Авито, что она решила заниматься покупкой, ремонтом и перепродажей вещей по более дорогой цене.')


def step2_umbrella():
    global painted_bears_house
    if (painted_bears_house):
        print('Утка напилась в баре и умерла от интоксикации.')
        time.sleep(1)
        print('Ладно, шучу.')
    print('Утка весело провела в баре время, выпила немного пива, не забыла заказать себе сухариков.')
    print('На следующий день у неё был выходной, она провела его, играя весь день в компьютер.')
    if not painted_bears_house:
        print('Потом у неё были четыре тяжёлых рабочих дня, с утра до ночи она красила берлогу медведя.')
        print('По окончании последнего рабочего дня она получила приятный денежный бонус от медведя и решила отпраздновать это событие.')
        painted_bears_house = True
        step1()
        return
    print('Утка продолжала работать по графику 4-1, пока у неё не кончилась краска (а у меня фантазия).')


def step2_no_umbrella():
    print('Пока утка шла в бар, пошёл дождь и утка промокла.')
    money_amount = 0
    print('Сколько у утки денег с собой? Введите количество монет у неё.')
    money_amount = int(input())
    if money_amount >= MONEY_AMOUNT_TO_BE_VERY_RICH:
        print('Пока утка шла в бар, нюхлер дапочувствовал запах большого количества монет и обокрал утку.')
        step3_no_money()
        return
    print('Утка очень расстроилась, она решила напиться до беспамятства, чтобы согреться и забыть свою печаль.')
    amount_of_beers = 0
    if money_amount <= MONEY_AMOUNT_TO_BE_NOT_POOR:
        print('poor')
        while money_amount > 0:
            amount_of_beers += 1
            money_amount -= 1
            print(f'Утка выпила {amount_of_beers} бокалов пива')
            time.sleep(1)
        print('Утка пропила все деньги, которые у неё были с собой, зато пошла домой счастливая.')
    else:
        while amount_of_beers < BEERS_TO_BECOME_DRUNK:
            amount_of_beers += 1
            money_amount -= 1
            print(f'Утка выпила {amount_of_beers} бокалов пива')
            time.sleep(1)
        print('Утка была настолько расстроена, что забыла заказать себе сухарики, поэтому очень быстро опьянела. '
              'Её выгнали из бара, ей предстоит долгое путешествие домой.')
        timeout = 0
        while timeout < DISTANCE_FROM_BAR_TO_HOME:
            print('Утка идёт домой.')
            time.sleep(1)
            timeout += 1
        print('Пока утка шла домой, она смотрела на звёзды и думала о том, что погода ей нипочём. '
              'Стояла прекрасная погода: никакого ветра, а температура была более чем комфортная. ')
        time.sleep(1)
        print('Утка пришла домой, легла спать, а наутро у неё болела голова.')


def step1():
    print(
        'Утка-маляр 🦆 решила выпить зайти в бар. '
        'Взять ей зонтик? ☂️'
    )
    option = ''
    options = {'да': True, 'нет': False}
    while option not in options:
        print('Выберите: {}/{}'.format(*options))
        option = input()

    if options[option]:
        return step2_umbrella()
    return step2_no_umbrella()


if __name__ == '__main__':
    step1()
    print('КОНЕЦ.')
